Terraform plan in __terraform/awsk3s01__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.primary will be created
  + resource "aws_eip" "primary" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "repo" = "yardbirdsax/infra-k8s"
        }
      + tags_all             = {
          + "repo" = "yardbirdsax/infra-k8s"
        }
      + vpc                  = true
    }

  # aws_eip_association.primary will be created
  + resource "aws_eip_association" "primary" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = "*******************"
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Provider aws is undefined

  on main.tf line 159, in module "k3s":
 159:     aws = aws

Module module.k3s does not declare a provider named aws.
If you wish to specify a provider configuration for the module, add an entry
for aws in the required_providers block within the module.
```
</details>

:white_check_mark: Plan applied in [AWSK3S01 Trunk Apply #11](https://github.com/yardbirdsax/infra-k8slab/actions/runs/1552126334)